In [4]:

import pandas as pd

In [29]:
dic1={
    'name': ['ahmed' ,'mohamed' , 'yasser' , 'abdo' ,'zyad' , 'shahd' , 'sama'],
    'grade' :[90,99,97,95,98,97,92] ,
    'gender': ['male' ,'male','male','male','male','female','female']
}

d=pd.DataFrame(dic1)
d

      name  grade  gender
0    ahmed     90    male
1  mohamed     99    male
2   yasser     97    male
3     abdo     95    male
4     zyad     98    male
5    shahd     97  female
6     sama     92  female

In [30]:
d.head(3)

      name  grade gender
0    ahmed     90   male
1  mohamed     99   male
2   yasser     97   male

In [7]:
d.tail(3)

    name  grade  gender
4   zyad     98    male
5  shahd     97  female
6   sama     92  female

In [8]:
print(d.shape)
print(d.shape[0])
print(d.shape[1])

(7, 3)
7
3

In [9]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   grade   7 non-null      int64
 2   gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [10]:
d.isnull().sum()

name      0
grade     0
gender    0
dtype: int64

In [11]:
d.isnull().sum(axis=0)

name      0
grade     0
gender    0
dtype: int64

In [12]:
d.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [13]:
d.describe(include='all')

        name      grade gender
count      7   7.000000      7
unique     7        NaN      2
top     sama        NaN   male
freq       1        NaN      5
mean     NaN  95.428571    NaN
std      NaN   3.309438    NaN
min      NaN  90.000000    NaN
25%      NaN  93.500000    NaN
50%      NaN  97.000000    NaN
75%      NaN  97.500000    NaN
max      NaN  99.000000    NaN

In [15]:
d['gender'].unique()

array(['male', 'female'], dtype=object)

In [16]:
d['gender'].value_counts()

male      5
female    2
Name: gender, dtype: int64

In [34]:

d

      name  grade  gender
0    ahmed     90    male
1  mohamed     99    male
2   yasser     97    male
3     abdo     95    male
4     zyad     98    male
5    shahd     97  female
6     sama     92  female

In [38]:
d[(d['grade']>=95) & (d['grade']<=100)]

      name  grade  gender
1  mohamed     99    male
2   yasser     97    male
3     abdo     95    male
4     zyad     98    male
5    shahd     97  female

In [41]:
d[d['grade'].between(95,100)]

      name  grade  gender
1  mohamed     99    male
2   yasser     97    male
3     abdo     95    male
4     zyad     98    male
5    shahd     97  female

In [42]:
d['grade'].mean()

95.42857142857143

In [43]:
def grade(x):
    return x/2

In [45]:
d['half_marks']=d['grade'].apply(grade)

In [46]:
d

      name  grade  gender  half_marks
0    ahmed     90    male        45.0
1  mohamed     99    male        49.5
2   yasser     97    male        48.5
3     abdo     95    male        47.5
4     zyad     98    male        49.0
5    shahd     97  female        48.5
6     sama     92  female        46.0

In [49]:
d['male_female']=d['gender'].map({'male' : 1 , 'female' : 0})
d

      name  grade  gender  half_marks  male_female
0    ahmed     90    male        45.0            1
1  mohamed     99    male        49.5            1
2   yasser     97    male        48.5            1
3     abdo     95    male        47.5            1
4     zyad     98    male        49.0            1
5    shahd     97  female        48.5            0
6     sama     92  female        46.0            0

In [50]:
d.drop('male_female',axis=1)

      name  grade  gender  half_marks
0    ahmed     90    male        45.0
1  mohamed     99    male        49.5
2   yasser     97    male        48.5
3     abdo     95    male        47.5
4     zyad     98    male        49.0
5    shahd     97  female        48.5
6     sama     92  female        46.0

In [51]:
d.drop('half_marks',axis=1)

      name  grade  gender  male_female
0    ahmed     90    male            1
1  mohamed     99    male            1
2   yasser     97    male            1
3     abdo     95    male            1
4     zyad     98    male            1
5    shahd     97  female            0
6     sama     92  female            0

In [52]:
d[d['gender'].isin(['male'])]

      name  grade gender  half_marks  male_female
0    ahmed     90   male        45.0            1
1  mohamed     99   male        49.5            1
2   yasser     97   male        48.5            1
3     abdo     95   male        47.5            1
4     zyad     98   male        49.0            1

In [53]:
d[d['gender']=='female'][['name' , 'grade']]

    name  grade
5  shahd     97
6   sama     92

In [54]:
d.sort_values(by= 'grade' , ascending=False)

      name  grade  gender  half_marks  male_female
1  mohamed     99    male        49.5            1
4     zyad     98    male        49.0            1
2   yasser     97    male        48.5            1
5    shahd     97  female        48.5            0
3     abdo     95    male        47.5            1
6     sama     92  female        46.0            0
0    ahmed     90    male        45.0            1

In [55]:
d.columns

Index(['name', 'grade', 'gender', 'half_marks', 'male_female'], dtype='object')